In [13]:
import pandas as pd
pd.set_option("display.max_rows",500)
pd.set_option("display.max_columns",500)

In [39]:
print()

Requirement already satisfied: pandas in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.22.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip available: 22.1.2 -> 22.2.2
[notice] To update, run: python.exe -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [3]:
df=pd.read_csv(r"C:\Users\RaghulRamesh\Downloads\18 - Day - 18 - Linear Regression Practise Python\18 - Day - 18 - Linear Regression Practise Python\company.csv")

In [4]:
df.head()

   Company   Age  Salary     Place
0      TCS  20.0     NaN   Chennai
1  Infosys  30.0     NaN    Mumbai
2      TCS  35.0  2300.0  Calcutta
3  Infosys  40.0  3000.0     Delhi
4      TCS  23.0  4000.0    Mumbai

In [5]:
df.tail()

     Company   Age  Salary     Place
143      TCS  33.0  9024.0  Calcutta
144  Infosys  22.0  8787.0  Calcutta
145  Infosys  44.0  4034.0     Delhi
146      TCS  33.0  5034.0    Mumbai
147  Infosys  22.0  8202.0    Cochin

In [6]:
df.head(10)

   Company   Age  Salary     Place
0      TCS  20.0     NaN   Chennai
1  Infosys  30.0     NaN    Mumbai
2      TCS  35.0  2300.0  Calcutta
3  Infosys  40.0  3000.0     Delhi
4      TCS  23.0  4000.0    Mumbai
5  Infosys   NaN  5000.0  Calcutta
6      TCS   NaN  6000.0   Chennai
7  Infosys  23.0  7000.0    Mumbai
8      TCS  34.0  8000.0  Calcutta
9      CTS  45.0  9000.0     Delhi

In [7]:
df.head(2)

   Company   Age  Salary    Place
0      TCS  20.0     NaN  Chennai
1  Infosys  30.0     NaN   Mumbai

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
dtypes: float64(2), object(2)
memory usage: 4.8+ KB

In [9]:
df.describe()

              Age       Salary
count  130.000000   124.000000
mean    30.484615  5312.467742
std     11.096640  2573.764683
min      0.000000  1089.000000
25%     22.000000  3030.000000
50%     32.500000  5000.000000
75%     37.750000  8000.000000
max     54.000000  9876.000000

In [11]:
df.columns

Index(['Company', 'Age', 'Salary', 'Place'], dtype='object')

In [14]:
df["Company"]

0                            TCS
1                        Infosys
2                            TCS
3                        Infosys
4                            TCS
5                        Infosys
6                            TCS
7                        Infosys
8                            TCS
9                            CTS
10                           CTS
11                           CTS
12                           CTS
13                           CTS
14                       Infosys
15                           TCS
16                       Infosys
17                           TCS
18                           TCS
19                       Infosys
20                           TCS
21                       Infosys
22                           TCS
23                       Infosys
24                           TCS
25                       Infosys
26                           TCS
27                           CTS
28                           CTS
29                           CTS
30                           CTS
31                           CTS
32                       Infosys
33                           TCS
34                       Infosys
35                           TCS
36                           TCS
37                           NaN
38                           TCS
39                       Infosys
40                           TCS
41                       Infosys
42                           TCS
43                       Infosys
44                           TCS
45                           CTS
46                           CTS
47                           CTS
48                           CTS
49                           CTS
50                       Infosys
51                           NaN
52                       Infosys
53                           TCS
54                           TCS
55                       Infosys
56                           TCS
57                       Infosys
58                           TCS
59                       Infosys
60                           TCS
61                           NaN
62     Tata Consultancy Services
63                           CTS
64                           NaN
65                           CTS
66                           CTS
67                    Congnizant
68                       Infosys
69                           TCS
70               Infosys Pvt Lmt
71                           TCS
72                           TCS
73                       Infosys
74                           TCS
75                       Infosys
76                           TCS
77                       Infosys
78                           TCS
79                       Infosys
80                           TCS
81                           CTS
82                           CTS
83                           CTS
84                           CTS
85                           CTS
86                       Infosys
87                           TCS
88                       Infosys
89                           TCS
90                           TCS
91                       Infosys
92                           TCS
93                       Infosys
94                           TCS
95                       Infosys
96                           TCS
97                       Infosys
98                           TCS
99                           CTS
100                          CTS
101                          CTS
102                          CTS
103                          CTS
104                      Infosys
105                          TCS
106                      Infosys
107                          TCS
108                          TCS
109                          NaN
110                          TCS
111                      Infosys
112                          TCS
113                      Infosys
114                          TCS
115                      Infosys
116                          TCS
117                          CTS
118                          CTS
119                          CTS
120                          CTS
121                          CTS
122                      Infosys
123                          NaN
124                      Infosys
125                          TCS
126                          TCS
127                      Infosys
128                          TCS
129                      Infosys
130                          TCS
131                      Infosys
132                          TCS
133                          NaN
134    Tata Consultancy Services
135                          CTS
136                          NaN
137                          CTS
138                          CTS
139                   Congnizant
140                      Infosys
141                          TCS
142              Infosys Pvt Lmt
143                          TCS
144                      Infosys
145                      Infosys
146                          TCS
147                      Infosys
Name: Company, dtype: object

In [15]:
df['Company'].value_counts()

TCS                          53
Infosys                      45
CTS                          36
Tata Consultancy Services     2
Congnizant                    2
Infosys Pvt Lmt               2
Name: Company, dtype: int64

In [21]:
df['Company'].replace({'Tata Consultancy Services':'TCS','Infosys Pvt Lmt':'Infosys','Congnizant':'CTS'},inplace=True)

In [22]:
df['Company'].value_counts()

TCS        55
Infosys    47
CTS        38
Name: Company, dtype: int64

In [42]:
df['Company'].mode()[0]

'TCS'

In [36]:
df['Company']=df['Company'].fillna(df['Company'].mode()[0])

In [37]:
df['Company'].value_counts()

TCS        63
Infosys    47
CTS        38
Name: Company, dtype: int64

In [40]:
df.columns

Index(['Company', 'Age', 'Salary', 'Place'], dtype='object')

In [46]:
df['Age'].isnull().sum()

18

In [47]:
df['Age'].mean()

30.484615384615385

In [48]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

In [49]:
df['Age']

0      20.000000
1      30.000000
2      35.000000
3      40.000000
4      23.000000
5      30.484615
6      30.484615
7      23.000000
8      34.000000
9      45.000000
10     23.000000
11     34.000000
12     45.000000
13     18.000000
14     40.000000
15     23.000000
16     23.000000
17     34.000000
18     22.000000
19     32.000000
20     37.000000
21     50.000000
22     21.000000
23     30.484615
24     30.484615
25     23.000000
26     34.000000
27     45.000000
28     23.000000
29     35.000000
30     46.000000
31     20.000000
32     45.000000
33     36.000000
34     26.000000
35     35.000000
36     32.000000
37     35.000000
38     34.000000
39     41.000000
40     24.000000
41     30.484615
42     30.484615
43     25.000000
44     35.000000
45     46.000000
46     24.000000
47     32.000000
48     43.000000
49     19.000000
50     41.000000
51     24.000000
52     21.000000
53     35.000000
54     21.000000
55     32.000000
56     38.000000
57     51.000000
58     23.000000
59     30.484615
60     30.484615
61     25.000000
62     36.000000
63     41.000000
64     25.000000
65     31.000000
66     41.000000
67     21.000000
68     43.000000
69     32.000000
70     21.000000
71     34.000000
72     24.000000
73     34.000000
74     37.000000
75     44.000000
76     32.000000
77     30.484615
78     30.484615
79     26.000000
80     32.000000
81     43.000000
82     22.000000
83     33.000000
84     43.000000
85     17.000000
86     41.000000
87     21.000000
88      0.000000
89     36.000000
90     21.000000
91     34.000000
92      0.000000
93     54.000000
94     22.000000
95     30.484615
96     30.484615
97     22.000000
98     33.000000
99     44.000000
100    22.000000
101     0.000000
102    44.000000
103    22.000000
104    44.000000
105    33.000000
106    22.000000
107     0.000000
108    33.000000
109    33.000000
110    33.000000
111     0.000000
112    22.000000
113    30.484615
114    30.484615
115    22.000000
116    33.000000
117    44.000000
118    22.000000
119    33.000000
120    44.000000
121     0.000000
122    44.000000
123    30.484615
124    22.000000
125    33.000000
126    20.000000
127    30.000000
128    33.000000
129    50.000000
130    21.000000
131    30.484615
132    30.484615
133    22.000000
134    31.000000
135    40.000000
136    30.484615
137    31.000000
138    44.000000
139    22.000000
140    44.000000
141    33.000000
142    22.000000
143    33.000000
144    22.000000
145    44.000000
146    33.000000
147    22.000000
Name: Age, dtype: float64

In [50]:
df['Age'].isnull().sum()

0

In [51]:
df['Salary'].isnull().sum()

24

In [52]:
df['Salary'].mean()

5312.467741935484

In [53]:
df['Salary'].fillna(df['Salary'].mean(),inplace=True)

In [54]:
df['Salary'].isnull().sum()

0

In [55]:
df['Salary']

0      5312.467742
1      5312.467742
2      2300.000000
3      3000.000000
4      4000.000000
5      5000.000000
6      6000.000000
7      7000.000000
8      8000.000000
9      9000.000000
10     5312.467742
11     1089.000000
12     5312.467742
13     1234.000000
14     3000.000000
15     3000.000000
16     3030.000000
17     5000.000000
18     5312.467742
19     5312.467742
20     3045.000000
21     3184.000000
22     4824.000000
23     5835.000000
24     7084.000000
25     8943.000000
26     8345.000000
27     9284.000000
28     9876.000000
29     2034.000000
30     7654.000000
31     2934.000000
32     4034.000000
33     5034.000000
34     8202.000000
35     9024.000000
36     5312.467742
37     5312.467742
38     2300.000000
39     3000.000000
40     4345.000000
41     5000.000000
42     6000.000000
43     7000.000000
44     8000.000000
45     9000.000000
46     5312.467742
47     1089.000000
48     5312.467742
49     1234.000000
50     3000.000000
51     3000.000000
52     3030.000000
53     5000.000000
54     6544.000000
55     7654.000000
56     3045.000000
57     3184.000000
58     4824.000000
59     5835.000000
60     7084.000000
61     8943.000000
62     8345.000000
63     9284.000000
64     6543.000000
65     2034.000000
66     5312.467742
67     2934.000000
68     4034.000000
69     5034.000000
70     8202.000000
71     9024.000000
72     5312.467742
73     5312.467742
74     2300.000000
75     3000.000000
76     4000.000000
77     5000.000000
78     6000.000000
79     7000.000000
80     8000.000000
81     9000.000000
82     5312.467742
83     1089.000000
84     5312.467742
85     1234.000000
86     3000.000000
87     3000.000000
88     3030.000000
89     5000.000000
90     5312.467742
91     5312.467742
92     3045.000000
93     3184.000000
94     4824.000000
95     5835.000000
96     7084.000000
97     8943.000000
98     8345.000000
99     9284.000000
100    5312.467742
101    2034.000000
102    5312.467742
103    2934.000000
104    4034.000000
105    5034.000000
106    8202.000000
107    9024.000000
108    5312.467742
109    5312.467742
110    2300.000000
111    3234.000000
112    4324.000000
113    5435.000000
114    5555.000000
115    8787.000000
116    8787.000000
117    9876.000000
118    5312.467742
119    1089.000000
120    5312.467742
121    1234.000000
122    3234.000000
123    3454.000000
124    8787.000000
125    5654.000000
126    5009.000000
127    5098.000000
128    3045.000000
129    3184.000000
130    4824.000000
131    5835.000000
132    7084.000000
133    8943.000000
134    8345.000000
135    9284.000000
136    5312.467742
137    2034.000000
138    3033.000000
139    2934.000000
140    4034.000000
141    5034.000000
142    8202.000000
143    9024.000000
144    8787.000000
145    4034.000000
146    5034.000000
147    8202.000000
Name: Salary, dtype: float64

In [56]:
df['Place'].isnull().sum()

14

In [59]:
df['Place'].fillna(df['Place'].mode()[0],inplace=True)

In [60]:
df['Place'].isnull().sum()

0

In [61]:
df['Place'].value_counts()

Mumbai        51
Calcutta      33
Chennai       14
Delhi         14
Cochin        13
Noida          8
Hyderabad      8
Podicherry     3
Pune           2
Bhopal         1
Nagpur         1
Name: Place, dtype: int64

In [63]:
df.duplicated().sum()

8

In [64]:
df[df.duplicated()]

     Company        Age       Salary     Place
84       CTS  43.000000  5312.467742    Mumbai
124  Infosys  22.000000  8787.000000  Calcutta
130      TCS  21.000000  4824.000000    Mumbai
131  Infosys  30.484615  5835.000000    Mumbai
144  Infosys  22.000000  8787.000000  Calcutta
145  Infosys  44.000000  4034.000000     Delhi
146      TCS  33.000000  5034.000000    Mumbai
147  Infosys  22.000000  8202.000000    Cochin

In [72]:
df=df.drop_duplicates()

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 140 entries, 0 to 143
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      140 non-null    float64
 2   Salary   140 non-null    float64
 3   Place    140 non-null    object
dtypes: float64(2), object(2)
memory usage: 5.5+ KB

In [79]:
df[(df['Company']=='Infosys') & (df['Place']=='Chennai') & (df['Age']>30) & (df['Salary']>5000)]

     Company        Age  Salary    Place
95   Infosys  30.484615  5835.0  Chennai
113  Infosys  30.484615  5435.0  Chennai

In [80]:
df[(df['Company']!='Infosys') & (df['Place']=='Chennai') & (df['Age']>30) & (df['Salary']>5000)]

   Company        Age       Salary    Place
6      TCS  30.484615  6000.000000  Chennai
12     CTS  45.000000  5312.467742  Chennai
24     TCS  30.484615  7084.000000  Chennai
30     CTS  46.000000  7654.000000  Chennai

In [84]:
df[(df['Company']=='Infosys') & ((df['Place']=='Chennai') | (df['Age']>30)) & (df['Salary']>5000)]

     Company        Age       Salary     Place
19   Infosys  32.000000  5312.467742    Mumbai
23   Infosys  30.484615  5835.000000    Cochin
55   Infosys  32.000000  7654.000000    Cochin
59   Infosys  30.484615  5835.000000    Mumbai
70   Infosys  21.000000  8202.000000   Chennai
73   Infosys  34.000000  5312.467742     Delhi
91   Infosys  34.000000  5312.467742  Calcutta
95   Infosys  30.484615  5835.000000   Chennai
113  Infosys  30.484615  5435.000000   Chennai

In [92]:
df.iloc[99:110,]

     Company   Age       Salary       Place
100      CTS  22.0  5312.467742      Cochin
101      CTS   0.0  2034.000000  Podicherry
102      CTS  44.0  5312.467742      Mumbai
103      CTS  22.0  2934.000000    Calcutta
104  Infosys  44.0  4034.000000       Delhi
105      TCS  33.0  5034.000000      Mumbai
106  Infosys  22.0  8202.000000      Cochin
107      TCS   0.0  9024.000000     Chennai
108      TCS  33.0  5312.467742      Mumbai
109      TCS  33.0  5312.467742    Calcutta
110      TCS  33.0  2300.000000       Delhi

In [91]:
df.iloc[99]

Company            CTS
Age               22.0
Salary     5312.467742
Place           Cochin
Name: 100, dtype: object

In [96]:
df.iloc[50:55,0:]

    Company   Age  Salary     Place
50  Infosys  41.0  3000.0   Chennai
51      TCS  24.0  3000.0    Mumbai
52  Infosys  21.0  3030.0  Calcutta
53      TCS  35.0  5000.0     Delhi
54      TCS  21.0  6544.0    Mumbai

In [97]:
df[df['Age']>50]

    Company   Age  Salary      Place
57  Infosys  51.0  3184.0  Hyderabad
93  Infosys  54.0  3184.0     Mumbai

In [98]:
df.loc[100:110,['Place','Company']]

          Place  Company
100      Cochin      CTS
101  Podicherry      CTS
102      Mumbai      CTS
103    Calcutta      CTS
104       Delhi  Infosys
105      Mumbai      TCS
106      Cochin  Infosys
107     Chennai      TCS
108      Mumbai      TCS
109    Calcutta      TCS
110       Delhi      TCS

In [99]:
df.head()

   Company   Age       Salary     Place
0      TCS  20.0  5312.467742   Chennai
1  Infosys  30.0  5312.467742    Mumbai
2      TCS  35.0  2300.000000  Calcutta
3  Infosys  40.0  3000.000000     Delhi
4      TCS  23.0  4000.000000    Mumbai

In [102]:
df=df.rename(columns={'Place':'City'})

In [103]:
df.head()

   Company   Age       Salary      City
0      TCS  20.0  5312.467742   Chennai
1  Infosys  30.0  5312.467742    Mumbai
2      TCS  35.0  2300.000000  Calcutta
3  Infosys  40.0  3000.000000     Delhi
4      TCS  23.0  4000.000000    Mumbai

In [120]:
df.drop(['City'],axis=1,inplace=True)

     Company        Age   Category       Bonus
0        TCS  20.000000  HIGH PAID  531.246774
1    Infosys  30.000000  HIGH PAID  531.246774
2        TCS  35.000000  less paid  230.000000
3    Infosys  40.000000  less paid  300.000000
4        TCS  23.000000  less paid  400.000000
5    Infosys  30.484615  HIGH PAID  500.000000
6        TCS  30.484615  HIGH PAID  600.000000
7    Infosys  23.000000  HIGH PAID  700.000000
8        TCS  34.000000  HIGH PAID  800.000000
9        CTS  45.000000  HIGH PAID  900.000000
10       CTS  23.000000  HIGH PAID  531.246774
11       CTS  34.000000  less paid  108.900000
12       CTS  45.000000  HIGH PAID  531.246774
13       CTS  18.000000  less paid  123.400000
14   Infosys  40.000000  less paid  300.000000
15       TCS  23.000000  less paid  300.000000
16   Infosys  23.000000  less paid  303.000000
17       TCS  34.000000  HIGH PAID  500.000000
18       TCS  22.000000  HIGH PAID  531.246774
19   Infosys  32.000000  HIGH PAID  531.246774
20       TCS  37.000000  less paid  304.500000
21   Infosys  50.000000  less paid  318.400000
22       TCS  21.000000  less paid  482.400000
23   Infosys  30.484615  HIGH PAID  583.500000
24       TCS  30.484615  HIGH PAID  708.400000
25   Infosys  23.000000  HIGH PAID  894.300000
26       TCS  34.000000  HIGH PAID  834.500000
27       CTS  45.000000  HIGH PAID  928.400000
28       CTS  23.000000  HIGH PAID  987.600000
29       CTS  35.000000  less paid  203.400000
30       CTS  46.000000  HIGH PAID  765.400000
31       CTS  20.000000  less paid  293.400000
32   Infosys  45.000000  less paid  403.400000
33       TCS  36.000000  HIGH PAID  503.400000
34   Infosys  26.000000  HIGH PAID  820.200000
35       TCS  35.000000  HIGH PAID  902.400000
36       TCS  32.000000  HIGH PAID  531.246774
37       TCS  35.000000  HIGH PAID  531.246774
38       TCS  34.000000  less paid  230.000000
39   Infosys  41.000000  less paid  300.000000
40       TCS  24.000000  less paid  434.500000
41   Infosys  30.484615  HIGH PAID  500.000000
42       TCS  30.484615  HIGH PAID  600.000000
43   Infosys  25.000000  HIGH PAID  700.000000
44       TCS  35.000000  HIGH PAID  800.000000
45       CTS  46.000000  HIGH PAID  900.000000
46       CTS  24.000000  HIGH PAID  531.246774
47       CTS  32.000000  less paid  108.900000
48       CTS  43.000000  HIGH PAID  531.246774
49       CTS  19.000000  less paid  123.400000
50   Infosys  41.000000  less paid  300.000000
51       TCS  24.000000  less paid  300.000000
52   Infosys  21.000000  less paid  303.000000
53       TCS  35.000000  HIGH PAID  500.000000
54       TCS  21.000000  HIGH PAID  654.400000
55   Infosys  32.000000  HIGH PAID  765.400000
56       TCS  38.000000  less paid  304.500000
57   Infosys  51.000000  less paid  318.400000
58       TCS  23.000000  less paid  482.400000
59   Infosys  30.484615  HIGH PAID  583.500000
60       TCS  30.484615  HIGH PAID  708.400000
61       TCS  25.000000  HIGH PAID  894.300000
62       TCS  36.000000  HIGH PAID  834.500000
63       CTS  41.000000  HIGH PAID  928.400000
64       TCS  25.000000  HIGH PAID  654.300000
65       CTS  31.000000  less paid  203.400000
66       CTS  41.000000  HIGH PAID  531.246774
67       CTS  21.000000  less paid  293.400000
68   Infosys  43.000000  less paid  403.400000
69       TCS  32.000000  HIGH PAID  503.400000
70   Infosys  21.000000  HIGH PAID  820.200000
71       TCS  34.000000  HIGH PAID  902.400000
72       TCS  24.000000  HIGH PAID  531.246774
73   Infosys  34.000000  HIGH PAID  531.246774
74       TCS  37.000000  less paid  230.000000
75   Infosys  44.000000  less paid  300.000000
76       TCS  32.000000  less paid  400.000000
77   Infosys  30.484615  HIGH PAID  500.000000
78       TCS  30.484615  HIGH PAID  600.000000
79   Infosys  26.000000  HIGH PAID  700.000000
80       TCS  32.000000  HIGH PAID  800.000000
81       CTS  43.000000  HIGH PAID  900.000000
82       CTS  22.000000  HIGH PAID  531.246774
83       CTS  33.000000  less paid  108.900000
85       CTS  17.000000  less paid  123.400000
86   Infosys  41.000000  less paid  300.000000
87       TCS  21.000000  less paid  300.000000
88   Infosys   0.000000  less paid  303.000000
89       TCS  36.000000  HIGH PAID  500.000000
90       TCS  21.000000  HIGH PAID  531.246774
91   Infosys  34.000000  HIGH PAID  531.246774
92       TCS   0.000000  less paid  304.500000
93   Infosys  54.000000  less paid  318.400000
94       TCS  22.000000  less paid  482.400000
95   Infosys  30.484615  HIGH PAID  583.500000
96       TCS  30.484615  HIGH PAID  708.400000
97   Infosys  22.000000  HIGH PAID  894.300000
98       TCS  33.000000  HIGH PAID  834.500000
99       CTS  44.000000  HIGH PAID  928.400000
100      CTS  22.000000  HIGH PAID  531.246774
101      CTS   0.000000  less paid  203.400000
102      CTS  44.000000  HIGH PAID  531.246774
103      CTS  22.000000  less paid  293.400000
104  Infosys  44.000000  less paid  403.400000
105      TCS  33.000000  HIGH PAID  503.400000
106  Infosys  22.000000  HIGH PAID  820.200000
107      TCS   0.000000  HIGH PAID  902.400000
108      TCS  33.000000  HIGH PAID  531.246774
109      TCS  33.000000  HIGH PAID  531.246774
110      TCS  33.000000  less paid  230.000000
111  Infosys   0.000000  less paid  323.400000
112      TCS  22.000000  less paid  432.400000
113  Infosys  30.484615  HIGH PAID  543.500000
114      TCS  30.484615  HIGH PAID  555.500000
115  Infosys  22.000000  HIGH PAID  878.700000
116      TCS  33.000000  HIGH PAID  878.700000
117      CTS  44.000000  HIGH PAID  987.600000
118      CTS  22.000000  HIGH PAID  531.246774
119      CTS  33.000000  less paid  108.900000
120      CTS  44.000000  HIGH PAID  531.246774
121      CTS   0.000000  less paid  123.400000
122  Infosys  44.000000  less paid  323.400000
123      TCS  30.484615  less paid  345.400000
125      TCS  33.000000  HIGH PAID  565.400000
126      TCS  20.000000  HIGH PAID  500.900000
127  Infosys  30.000000  HIGH PAID  509.800000
128      TCS  33.000000  less paid  304.500000
129  Infosys  50.000000  less paid  318.400000
132      TCS  30.484615  HIGH PAID  708.400000
133      TCS  22.000000  HIGH PAID  894.300000
134      TCS  31.000000  HIGH PAID  834.500000
135      CTS  40.000000  HIGH PAID  928.400000
136      TCS  30.484615  HIGH PAID  531.246774
137      CTS  31.000000  less paid  203.400000
138      CTS  44.000000  less paid  303.300000
139      CTS  22.000000  less paid  293.400000
140  Infosys  44.000000  less paid  403.400000
141      TCS  33.000000  HIGH PAID  503.400000
142  Infosys  22.000000  HIGH PAID  820.200000
143      TCS  33.000000  HIGH PAID  902.400000

In [109]:
df.head()

   Company   Age       Salary
0      TCS  20.0  5312.467742
1  Infosys  30.0  5312.467742
2      TCS  35.0  2300.000000
3  Infosys  40.0  3000.000000
4      TCS  23.0  4000.000000

In [113]:
def get_category(sal):
    if sal>=5000:
        return "HIGH PAID"
    return "less paid"

In [114]:
df['Category']=df['Salary'].apply(get_category)

In [116]:
df

     Company        Age       Salary   Category
0        TCS  20.000000  5312.467742  HIGH PAID
1    Infosys  30.000000  5312.467742  HIGH PAID
2        TCS  35.000000  2300.000000  less paid
3    Infosys  40.000000  3000.000000  less paid
4        TCS  23.000000  4000.000000  less paid
5    Infosys  30.484615  5000.000000  HIGH PAID
6        TCS  30.484615  6000.000000  HIGH PAID
7    Infosys  23.000000  7000.000000  HIGH PAID
8        TCS  34.000000  8000.000000  HIGH PAID
9        CTS  45.000000  9000.000000  HIGH PAID
10       CTS  23.000000  5312.467742  HIGH PAID
11       CTS  34.000000  1089.000000  less paid
12       CTS  45.000000  5312.467742  HIGH PAID
13       CTS  18.000000  1234.000000  less paid
14   Infosys  40.000000  3000.000000  less paid
15       TCS  23.000000  3000.000000  less paid
16   Infosys  23.000000  3030.000000  less paid
17       TCS  34.000000  5000.000000  HIGH PAID
18       TCS  22.000000  5312.467742  HIGH PAID
19   Infosys  32.000000  5312.467742  HIGH PAID
20       TCS  37.000000  3045.000000  less paid
21   Infosys  50.000000  3184.000000  less paid
22       TCS  21.000000  4824.000000  less paid
23   Infosys  30.484615  5835.000000  HIGH PAID
24       TCS  30.484615  7084.000000  HIGH PAID
25   Infosys  23.000000  8943.000000  HIGH PAID
26       TCS  34.000000  8345.000000  HIGH PAID
27       CTS  45.000000  9284.000000  HIGH PAID
28       CTS  23.000000  9876.000000  HIGH PAID
29       CTS  35.000000  2034.000000  less paid
30       CTS  46.000000  7654.000000  HIGH PAID
31       CTS  20.000000  2934.000000  less paid
32   Infosys  45.000000  4034.000000  less paid
33       TCS  36.000000  5034.000000  HIGH PAID
34   Infosys  26.000000  8202.000000  HIGH PAID
35       TCS  35.000000  9024.000000  HIGH PAID
36       TCS  32.000000  5312.467742  HIGH PAID
37       TCS  35.000000  5312.467742  HIGH PAID
38       TCS  34.000000  2300.000000  less paid
39   Infosys  41.000000  3000.000000  less paid
40       TCS  24.000000  4345.000000  less paid
41   Infosys  30.484615  5000.000000  HIGH PAID
42       TCS  30.484615  6000.000000  HIGH PAID
43   Infosys  25.000000  7000.000000  HIGH PAID
44       TCS  35.000000  8000.000000  HIGH PAID
45       CTS  46.000000  9000.000000  HIGH PAID
46       CTS  24.000000  5312.467742  HIGH PAID
47       CTS  32.000000  1089.000000  less paid
48       CTS  43.000000  5312.467742  HIGH PAID
49       CTS  19.000000  1234.000000  less paid
50   Infosys  41.000000  3000.000000  less paid
51       TCS  24.000000  3000.000000  less paid
52   Infosys  21.000000  3030.000000  less paid
53       TCS  35.000000  5000.000000  HIGH PAID
54       TCS  21.000000  6544.000000  HIGH PAID
55   Infosys  32.000000  7654.000000  HIGH PAID
56       TCS  38.000000  3045.000000  less paid
57   Infosys  51.000000  3184.000000  less paid
58       TCS  23.000000  4824.000000  less paid
59   Infosys  30.484615  5835.000000  HIGH PAID
60       TCS  30.484615  7084.000000  HIGH PAID
61       TCS  25.000000  8943.000000  HIGH PAID
62       TCS  36.000000  8345.000000  HIGH PAID
63       CTS  41.000000  9284.000000  HIGH PAID
64       TCS  25.000000  6543.000000  HIGH PAID
65       CTS  31.000000  2034.000000  less paid
66       CTS  41.000000  5312.467742  HIGH PAID
67       CTS  21.000000  2934.000000  less paid
68   Infosys  43.000000  4034.000000  less paid
69       TCS  32.000000  5034.000000  HIGH PAID
70   Infosys  21.000000  8202.000000  HIGH PAID
71       TCS  34.000000  9024.000000  HIGH PAID
72       TCS  24.000000  5312.467742  HIGH PAID
73   Infosys  34.000000  5312.467742  HIGH PAID
74       TCS  37.000000  2300.000000  less paid
75   Infosys  44.000000  3000.000000  less paid
76       TCS  32.000000  4000.000000  less paid
77   Infosys  30.484615  5000.000000  HIGH PAID
78       TCS  30.484615  6000.000000  HIGH PAID
79   Infosys  26.000000  7000.000000  HIGH PAID
80       TCS  32.000000  8000.000000  HIGH PAID
81       CTS  43.000000  9000.000000  HIGH PAID
82       CTS  22.000000  5312.467742  HIGH PAID
83       CTS  33.000000  1089.000000  less paid
85       CTS  17.000000  1234.000000  less paid
86   Infosys  41.000000  3000.000000  less paid
87       TCS  21.000000  3000.000000  less paid
88   Infosys   0.000000  3030.000000  less paid
89       TCS  36.000000  5000.000000  HIGH PAID
90       TCS  21.000000  5312.467742  HIGH PAID
91   Infosys  34.000000  5312.467742  HIGH PAID
92       TCS   0.000000  3045.000000  less paid
93   Infosys  54.000000  3184.000000  less paid
94       TCS  22.000000  4824.000000  less paid
95   Infosys  30.484615  5835.000000  HIGH PAID
96       TCS  30.484615  7084.000000  HIGH PAID
97   Infosys  22.000000  8943.000000  HIGH PAID
98       TCS  33.000000  8345.000000  HIGH PAID
99       CTS  44.000000  9284.000000  HIGH PAID
100      CTS  22.000000  5312.467742  HIGH PAID
101      CTS   0.000000  2034.000000  less paid
102      CTS  44.000000  5312.467742  HIGH PAID
103      CTS  22.000000  2934.000000  less paid
104  Infosys  44.000000  4034.000000  less paid
105      TCS  33.000000  5034.000000  HIGH PAID
106  Infosys  22.000000  8202.000000  HIGH PAID
107      TCS   0.000000  9024.000000  HIGH PAID
108      TCS  33.000000  5312.467742  HIGH PAID
109      TCS  33.000000  5312.467742  HIGH PAID
110      TCS  33.000000  2300.000000  less paid
111  Infosys   0.000000  3234.000000  less paid
112      TCS  22.000000  4324.000000  less paid
113  Infosys  30.484615  5435.000000  HIGH PAID
114      TCS  30.484615  5555.000000  HIGH PAID
115  Infosys  22.000000  8787.000000  HIGH PAID
116      TCS  33.000000  8787.000000  HIGH PAID
117      CTS  44.000000  9876.000000  HIGH PAID
118      CTS  22.000000  5312.467742  HIGH PAID
119      CTS  33.000000  1089.000000  less paid
120      CTS  44.000000  5312.467742  HIGH PAID
121      CTS   0.000000  1234.000000  less paid
122  Infosys  44.000000  3234.000000  less paid
123      TCS  30.484615  3454.000000  less paid
125      TCS  33.000000  5654.000000  HIGH PAID
126      TCS  20.000000  5009.000000  HIGH PAID
127  Infosys  30.000000  5098.000000  HIGH PAID
128      TCS  33.000000  3045.000000  less paid
129  Infosys  50.000000  3184.000000  less paid
132      TCS  30.484615  7084.000000  HIGH PAID
133      TCS  22.000000  8943.000000  HIGH PAID
134      TCS  31.000000  8345.000000  HIGH PAID
135      CTS  40.000000  9284.000000  HIGH PAID
136      TCS  30.484615  5312.467742  HIGH PAID
137      CTS  31.000000  2034.000000  less paid
138      CTS  44.000000  3033.000000  less paid
139      CTS  22.000000  2934.000000  less paid
140  Infosys  44.000000  4034.000000  less paid
141      TCS  33.000000  5034.000000  HIGH PAID
142  Infosys  22.000000  8202.000000  HIGH PAID
143      TCS  33.000000  9024.000000  HIGH PAID

In [117]:
df['Bonus']=df['Salary']*0.1

In [118]:
df.head(10)

   Company        Age       Salary   Category       Bonus
0      TCS  20.000000  5312.467742  HIGH PAID  531.246774
1  Infosys  30.000000  5312.467742  HIGH PAID  531.246774
2      TCS  35.000000  2300.000000  less paid  230.000000
3  Infosys  40.000000  3000.000000  less paid  300.000000
4      TCS  23.000000  4000.000000  less paid  400.000000
5  Infosys  30.484615  5000.000000  HIGH PAID  500.000000
6      TCS  30.484615  6000.000000  HIGH PAID  600.000000
7  Infosys  23.000000  7000.000000  HIGH PAID  700.000000
8      TCS  34.000000  8000.000000  HIGH PAID  800.000000
9      CTS  45.000000  9000.000000  HIGH PAID  900.000000

In [123]:
df.groupby(['Company'])['Salary'].sum()

Company
CTS        176863.677419
Infosys    214852.870968
TCS        343713.209677
Name: Salary, dtype: float64

In [124]:
df.groupby(['Company'])['Salary'].min()

Company
CTS        1089.0
Infosys    3000.0
TCS        2300.0
Name: Salary, dtype: float64

In [125]:
df.groupby(['Company'])['Salary'].max()

Company
CTS        9876.0
Infosys    8943.0
TCS        9024.0
Name: Salary, dtype: float64

In [128]:
df.groupby(['Company'])['Salary'].agg([min,max,sum])

            min     max            sum
Company
CTS      1089.0  9876.0  176863.677419
Infosys  3000.0  8943.0  214852.870968
TCS      2300.0  9024.0  343713.209677

In [129]:
df.groupby(['Company','Category'])['Salary'].agg([min,max,sum])

                           min     max            sum
Company Category
CTS     HIGH PAID  5312.467742  9876.0  144666.677419
        less paid  1089.000000  3033.0   32197.000000
Infosys HIGH PAID  5000.000000  8943.0  152422.870968
        less paid  3000.000000  4034.0   62430.000000
TCS     HIGH PAID  5000.000000  9024.0  278738.209677
        less paid  2300.000000  4824.0   64975.000000

In [139]:
df['Updated_Age']=df['Age'].apply(lambda a : 21.5 if a < 21 else a)

In [140]:
df=df.sort_values(by=['Salary','Age'],ascending=False)

In [141]:
df.to_csv(r'C:\Users\RaghulRamesh\OneDrive\Desktop\Ericsson\Company_Final.csv',index=False)